src/views/guia-linux/linux-particionamiento.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-02 vie 19:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guia Linux - Conceptos Particionamiento</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="jelou" />
<link rel="stylesheet" type="text/css" href="/assets/css/style.css"/>
<link rel="stylesheet" type="text/css" href="/assets/css/sass-style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Guia Linux - Conceptos Particionamiento</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7ab95d3">1. Particionar Disco</a>
<ul>
<li><a href="#org111eda9">1.1. Partición para Almacenamiento</a></li>
<li><a href="#org1cab054">1.2. Listar las particiones</a></li>
<li><a href="#orgfb3d73d">1.3. Montar la particion de Almacenamiento NTFS</a>
<ul>
<li><a href="#orgf83b2fa">1.3.1. Crear directorio de almacenamiento a compartir</a></li>
<li><a href="#org301ee92">1.3.2. Montar la partición del directorio</a></li>
</ul>
</li>
<li><a href="#org22f3fbe">1.4. Anclar un directorio al Gestor de archivos</a></li>
<li><a href="#orga0e8691">1.5. Referencias Web Extraoficiales</a></li>
<li><a href="#orgd90aaa3">1.6. Referencias Youtube</a></li>
</ul>
</li>
<li><a href="#orgeaf44d9">2. Bootear Multiples Sistemas Operativos</a>
<ul>
<li><a href="#org9b6cb14">2.1. Conceptos</a></li>
<li><a href="#org0803121">2.2. Conocer versión del GRUB</a></li>
<li><a href="#org96eb71e">2.3. Referencias Web Extraoficiales</a></li>
</ul>
</li>
<li><a href="#orged04c20">3. Particionar con GParted</a>
<ul>
<li><a href="#org3728142">3.1. Conceptos</a></li>
<li><a href="#org146fd1e">3.2. Referencias Web Oficiales</a></li>
<li><a href="#orgf36c340">3.3. Referencias Youtube</a></li>
</ul>
</li>
<li><a href="#org2b59e8a">4. Instalar un file manager</a>
<ul>
<li><a href="#org5e0e2b3">4.1. Conceptos</a></li>
<li><a href="#orgd6f38be">4.2. Referencias Youtube</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7ab95d3" class="outline-2">
<h2 id="org7ab95d3"><span class="section-number-2">1</span> Particionar Disco</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org111eda9" class="outline-3">
<h3 id="org111eda9"><span class="section-number-3">1.1</span> Partición para Almacenamiento</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Creamos una partición primaria del tipo NTFS y le asignamos los permisos al usuario
Con el comando ``id -u -n`` obtenemos el nombre de usuario, mientras que con ``chown`` 
le damos acceso a un usuario especifico a un directorio/archivo
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org197c89f"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para saber el nombre de usuario</span>
id -u -n

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">para asignarle los permisos de ese usuario</span>
sudo chown nombreUsuario /storage/
</pre>
</div>
</div>
</div>
<div id="outline-container-org1cab054" class="outline-3">
<h3 id="org1cab054"><span class="section-number-3">1.2</span> Listar las particiones</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Podemos usar el comando ``lsblk`` o ``fdisk``
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org2a45255"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">listar particiones (no pide permisos administrador)</span>
lsblk

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">listar particiones (pide permisos administrador)</span>
sudo fdisk -l /dev/sda
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfb3d73d" class="outline-3">
<h3 id="orgfb3d73d"><span class="section-number-3">1.3</span> Montar la particion de Almacenamiento NTFS</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Si la partición va interactuar entre Windows y Linux, se recomienda que sea NTFS.
Si sólo va a ser entre distribuciones Linux, se recomienda Ext4
</p>

<p>
Destacamos un comentario de otro usuario linux 
</p>

<blockquote>
<p>
A good practice for some static mounted storage system like you are doing is 
to add a permanent mount point to /etc/fstab.
There are several ways to do it, but I just wanted you to be aware.
</p>
</blockquote>
</div>
<div id="outline-container-orgf83b2fa" class="outline-4">
<h4 id="orgf83b2fa"><span class="section-number-4">1.3.1</span> Crear directorio de almacenamiento a compartir</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Recordando que la ruta <b>/</b> es la raiz y <b>mnt</b> el directorio que se 
se suele utilizar por defecto para acceder desde los demas distribuciones
</p>

<p>
Tambien que con el comando ``mkdir`` seguido del parametro <b>-p</b> nos facilita
un directorio A con subdirectorio B (dentro del directorio A)
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org9e2833f"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Creamos el directorio mnt y dentro mystorage</span>
sudo mkdir -p /mnt/mystorage
</pre>
</div>
</div>
</div>
<div id="outline-container-org301ee92" class="outline-4">
<h4 id="org301ee92"><span class="section-number-4">1.3.2</span> Montar la partición del directorio</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>Con ``id -u`` nos permite obtener el nombre de usuario que esta en la sesion actual de la terminal</li>
<li>Los parametros del comando ``mount``
<ol class="org-ol">
<li><b><b>-uid</b></b> le pasamos el usuario que nos devuelve ``id -u``</li>
<li><b><b>dmask</b></b></li>
<li><b><b>fmask</b></b></li>
<li><b><b>/dev/sda10</b></b> es la particion de almacenamiento</li>
</ol></li>
</ul>

<div class="org-src-container">
<pre class="src src-shell" id="orga41cb22"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">nos devuelve el id del usuario con el que iniciamos la sesion</span>
id -u

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">solo cambiamos el 1001 por lo que nos devuelve id -u</span>
sudo mount -o rw,user,<span style="color: #7590db;">uid</span>=<span style="color: #a45bad;">1001,dmask</span>=<span style="color: #a45bad;">007,fmask</span>=<span style="color: #a45bad;">117</span> /dev/sda10 /mnt/mystorage

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">sudo mount -t ntfs -o ro /dev/sda10 /mnt/mystorage</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org22f3fbe" class="outline-3">
<h3 id="org22f3fbe"><span class="section-number-3">1.4</span> Anclar un directorio al Gestor de archivos</h3>
<div class="outline-text-3" id="text-1-4">
<p>
El File manager por defecto de Ubuntu es Nautilus
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org00848c3"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">presionar Control+D</span>
<span style="color: #4f97d7;">cd</span> /mnt/mystorage
</pre>
</div>
</div>
</div>
<div id="outline-container-orga0e8691" class="outline-3">
<h3 id="orga0e8691"><span class="section-number-3">1.5</span> Referencias Web Extraoficiales</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>[Referencia #2 - Ver Pagina](<a href="https://linuxconfig.org/how-to-mount-partition-with-ntfs-file-system-and-read-write-access">https://linuxconfig.org/how-to-mount-partition-with-ntfs-file-system-and-read-write-access</a>)</li>
<li>[Referencia #3 - Ver Página](<a href="https://askubuntu.com/questions/11840/how-do-i-use-chmod-on-an-ntfs-or-fat32-partition/956072#956072">https://askubuntu.com/questions/11840/how-do-i-use-chmod-on-an-ntfs-or-fat32-partition/956072#956072</a>)</li>
<li>[Agregar carpetas al Nautilus - Ver Página](<a href="https://askubuntu.com/questions/1109247/how-do-i-add-folder-to-ubuntu-18-04-1-nautilus-bookmark-list">https://askubuntu.com/questions/1109247/how-do-i-add-folder-to-ubuntu-18-04-1-nautilus-bookmark-list</a>)</li>
<li>[Opciones de Montaje - Ver Pagina (it-swarm.dev)](<a href="https://www.it-swarm.dev/es/mount/opciones-de-montaje-dmask-y-fmask/961637140/">https://www.it-swarm.dev/es/mount/opciones-de-montaje-dmask-y-fmask/961637140/</a>)</li>
</ul>
</div>
</div>
<div id="outline-container-orgd90aaa3" class="outline-3">
<h3 id="orgd90aaa3"><span class="section-number-3">1.6</span> Referencias Youtube</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>[Referencia #1 - Ver Video](<a href="https://www.youtube.com/watch?v=mPDhoYNao1o">https://www.youtube.com/watch?v=mPDhoYNao1o</a>)</li>
<li>[Referencia #4 - Ver Video](<a href="https://www.youtube.com/watch?v=hIq1dIgZrOc">https://www.youtube.com/watch?v=hIq1dIgZrOc</a>)</li>
<li>[Referencia #5 - Ver Video](<a href="https://www.youtube.com/watch?v=ZlIbGnvTEDI">https://www.youtube.com/watch?v=ZlIbGnvTEDI</a>)</li>
<li>[Particiones primarias/logicas/extendidas - Ver Video](<a href="https://www.youtube.com/watch?v=CSbUiK2pytE">https://www.youtube.com/watch?v=CSbUiK2pytE</a>)</li>
<li>[Recuperar Tabla de Particiones - Ver Video](<a href="https://www.youtube.com/watch?v=I1-0cpPO3e8">https://www.youtube.com/watch?v=I1-0cpPO3e8</a>)</li>
<li>[Redimensionar Particiones en Ubuntu - Ver Video](<a href="https://www.youtube.com/watch?v=EQMWKwvsltY">https://www.youtube.com/watch?v=EQMWKwvsltY</a>)</li>
<li>[Redimensionar particiones - Ver Videos](<a href="https://www.youtube.com/watch?v=OSkK_lgSCzk">https://www.youtube.com/watch?v=OSkK_lgSCzk</a>)</li>
<li>[Particionar disco duro en Ubuntu - Ver Video](<a href="https://www.youtube.com/watch?v=xuYhjtpWZuc">https://www.youtube.com/watch?v=xuYhjtpWZuc</a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgeaf44d9" class="outline-2">
<h2 id="orgeaf44d9"><span class="section-number-2">2</span> Bootear Multiples Sistemas Operativos</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9b6cb14" class="outline-3">
<h3 id="org9b6cb14"><span class="section-number-3">2.1</span> Conceptos</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Si tenes un sistema operativo por defecto por ejemplo Windows, y lo queres mantener
podemos recurrir a como dicen "bootear" varios sistemas operativos, en este caso seria 
varias distribuciones de linux.
</p>

<p>
Por lo general se suele crear un GRUB el que se ira modificando
</p>

<p>
Comentarios a destacar de uno de los artículos de las referencias que hemos agregado
</p>

<blockquote>
<p>
I install Ubuntu GNOME (mount point: / ) into /dev/sda5.
I remember to give mount points to /work (ext4) and /storage (NTFS) like mentioned 
in the 2.3 section of this article. Be careful not to mark them as to be formatted.
The Swap partition gets automatically recognized, no need to worry about that.
</p>
</blockquote>

<blockquote>
<p>
I install Manjaro XFCE to /dev/sda6 partition. And once again, 
I remember to give mount points to /work (ext4) and /storage (NTFS) and to NOT format them.
</p>
</blockquote>

<blockquote>
<p>
I install Kubuntu ( / ) to /dev/sda8. Mount points also to /work (ext4) 
and /storage (NTFS), again. And, the Swap partition gets automatically recognized, again.
And finally, after installation is successfully finished, one last time to install the 
</p>

<p>
Refind boot manager in Terminal in Xubuntu:
sudo dpkg -i ~/Downloads/refind<sub>0.10.4</sub>-1<sub>amd64.deb</sub>
</p>
</blockquote>

<p>
<b>Observación:</b>
Por el momento sólo recomendamos ver las referencias Web que adjuntamos
</p>
</div>
</div>
<div id="outline-container-org0803121" class="outline-3">
<h3 id="org0803121"><span class="section-number-3">2.2</span> Conocer versión del GRUB</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-shell" id="org44d6e70"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">saber la version de grub</span>
grub-install -v
</pre>
</div>
</div>
</div>
<div id="outline-container-org96eb71e" class="outline-3">
<h3 id="org96eb71e"><span class="section-number-3">2.3</span> Referencias Web Extraoficiales</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>[Referencia #1 - Ver Página](<a href="https://medium.com/@manujarvinen/setting-up-a-multi-boot-of-5-linux-distributions-ca1fcf8d502">https://medium.com/@manujarvinen/setting-up-a-multi-boot-of-5-linux-distributions-ca1fcf8d502</a>)</li>
<li>[Referencia # 2 - Ver Página](<a href="https://www.maketecheasier.com/how-to-run-multiple-linux-distros-without-virtualization/">https://www.maketecheasier.com/how-to-run-multiple-linux-distros-without-virtualization/</a>)</li>
<li>[MultipleLInuxONe - Ver Página](<a href="https://itsfoss.com/multiple-linux-one-usb/">https://itsfoss.com/multiple-linux-one-usb/</a>)</li>
<li>[Referencia #3 - Ver Página](<a href="https://www.solvetic.com/tutoriales/article/5859-como-crear-usb-booteable-linux-con-iso/">https://www.solvetic.com/tutoriales/article/5859-como-crear-usb-booteable-linux-con-iso/</a>)</li>
<li>[Referencia #4 - Ver Página](<a href="https://linuxmint-installation-guide.readthedocs.io/es/latest/burn.html">https://linuxmint-installation-guide.readthedocs.io/es/latest/burn.html</a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orged04c20" class="outline-2">
<h2 id="orged04c20"><span class="section-number-2">3</span> Particionar con GParted</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3728142" class="outline-3">
<h3 id="org3728142"><span class="section-number-3">3.1</span> Conceptos</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Es el que se recomienda para particionar el disco
</p>
</div>
</div>
<div id="outline-container-org146fd1e" class="outline-3">
<h3 id="org146fd1e"><span class="section-number-3">3.2</span> Referencias Web Oficiales</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>[Pagina Oficial - Ver Página](<a href="https://gparted.org/download.php">https://gparted.org/download.php</a>)</li>
</ul>
</div>
</div>
<div id="outline-container-orgf36c340" class="outline-3">
<h3 id="orgf36c340"><span class="section-number-3">3.3</span> Referencias Youtube</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>[Redimensionar con Gparted en Ubuntu - Ver Video](<a href="https://www.youtube.com/watch?v=PBHFud-Dva8">https://www.youtube.com/watch?v=PBHFud-Dva8</a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2b59e8a" class="outline-2">
<h2 id="org2b59e8a"><span class="section-number-2">4</span> Instalar un file manager</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5e0e2b3" class="outline-3">
<h3 id="org5e0e2b3"><span class="section-number-3">4.1</span> Conceptos</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Si aún no estás familiarizado a usar por completo la terminal para la gestión de archivos,
te sugerimos instalar un programa con interfaz gráfica (GUI) que facilita dicha tarea.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgc657488">sudo apt-get install thunar
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd6f38be" class="outline-3">
<h3 id="orgd6f38be"><span class="section-number-3">4.2</span> Referencias Youtube</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Como funciona el Filesystem de Linux - # Referencia 1  [Ver Video](<a href="https://www.youtube.com/watch?v=HIXzJ3Rz9po">https://www.youtube.com/watch?v=HIXzJ3Rz9po</a>)</li>
<li>Como funciona el Filesystem de Linux - # Referencia 1  [Ver Video](<a href="https://www.youtube.com/watch?v=HbgzrKJvDRw">https://www.youtube.com/watch?v=HbgzrKJvDRw</a>)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-04-02 vie 19:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
